app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "Wow, I hate TDD"], ["created_at", Sun, 16 Dec 2012 02:04:12 UTC +00:00], ["updated_at", Sun, 16 Dec 2012 02:04:12 UTC +00:00], ["user_id", 101]]
---
  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save

DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 301]]
---
  def destroy
    @micropost.destroy