app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 3 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 101
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

INSERT INTO "users" ("admin", "created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create

    @user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(page: params[:page])

UPDATE "users" SET "password_digest" = '$2a$10$U/PHAZAfzoClq6OdRQOEku8M4cYzM6yq3Gd6v63q5VlNJljp8WoOq', "remember_token" = 'CGW_Jlo3AT971KlelL5jHw', "updated_at" = '2012-12-15 23:03:35.136245' WHERE "users"."id" = 101
---
  def update
    if @user.update_attributes(params[:user])